Revit 2024 API
Railing.Flipped Property
 Indicates if the railing is flipped.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool Flipped { get; }
Visual Basic
Public ReadOnly Property Flipped As Boolean
	Get
Visual C++
public:
property bool Flipped {
	bool get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  The railing has incorrect internal data.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace